[{"text": "INZAMUL HOQUE\nBarpeta, Assam | +918402098761 | inzamol@gmail.com | LinkedIn | GitHub\nResults-driven Sr. Software Engineer with 4 years (approx.) of experience in Python, Django, FastAPI, and REST\nAPI development. Skilled in AWS, backend optimization, and system automation with a strong focus on building\nscalable, efficient solutions. Passionate about leveraging Generative AI for intelligent automation, API\nintegration, and next-gen application development."}, {"text": "Skills\nLanguages: Python, JavaScript, Node.js, SQL\nFrameworks: Django, FastAPI, Flask, Django REST Framework (DRF), React\nLibraries & Tools: Pandas, NumPy, Pytest, Boto3, OpenCV, Matplotlib, Celery\nDatabases: PostgreSQL, MySQL, SQLite, MongoDB, MS SQL Server, Redis\nCloud & DevOps: AWS, Azure, VPS, Git, CI/CD, Docker, Kubernetes, Nginx, Linux, Virtualization\nSecurity & Networking: Firewall, VPN, SSL/TLS, Vulnerability Fixing\nMessaging & Monitoring: RabbitMQ, Apache Superset, Zabbix\nAI & ML: GenAI, Langchain, CrewAI, OpenAI\nExperience\nSenior Software Engineer | Dentsu Global Service | Bengaluru, Karnataka | Apr 2025 – Present\n• Engineered high-performance REST APIs using FastAPI improving scalability and response times."}, {"text": "• Designed and implemented a task scheduling system with FastAPI, Celery, RabbitMQ, Redis and\nSQLAlchemy, achieving 100% reliability and fault tolerance. • Developed Apache Superset plugin to create and embed tailored charts and dashboard\n• Integrated GenAI in existing application to extract insides from large data and generate reports. Associate Software Engineer | Kanaka Software | Pune, Maharashtra | Feb 2022 – Mar 2025\n• Built and optimized REST APIs with Django, FastAPI, and Golang and developed frontends in React. • Automated email attachment ingestion with Python + PostgreSQL cutting manual effort by 90%. • Designed a GUI tool that streamlined deployment pipelines, reducing DevOps dependency by ~80%."}, {"text": "• Automated deployments using shell scripts, AWS, Azure, and Linux-based CI/CD pipelines,\nachieving ~100% automation. • Independently architected and deployed a FastAPI backend with Alembic, SQL Server, and Docker,\nconfigured Nginx for load balancing and reverse proxy. Projects\nSOM-Sobeys | Python, FastAPI, MS SQL, React, Docker, Pandas, NumPy\n• Architected a scalable asynchronous backend with high-performance REST APIs. • Deployed securely on CyberArk Windows Server with Nginx load balancing. • Implemented SSL, JWT, CORS, and rate limiting for secure API access. • Achieved 100% CI/CD automation for testing and deployments. EVP (WAIVIT, VALTOOL, SNAP) | Go, React, PostgreSQL\n• Developed RESTful APIs using Go Mux, optimizing enterprise app performance."}, {"text": "• Automated deployments with CI/CD pipelines on AWS, achieving 100% automation. • Integrated FOXY AI and AI Service into WAIVIT to generate AI-powered property reports. • Designed LENDSMART microservice to expose APIs from VALTOOL, enhancing integration. OPS Data | Python, Pandas, NumPy, Graph API, PostgreSQL, Flask, Docker, Microservices\n• Automated email attachment ingestion with custom processing rules, storing results in PostgreSQL. • Built a microservices-based architecture for modular processing. • Integrated with Power BI for real-time reporting and visualization. EVP Dev Tool | Python, Tkinter, SQLite\n• Created a GUI-based one-click deployment tool in Python, simplifying release management."}, {"text": "Quantuvos | Python, Django, PostgreSQL, Angular\n• Engineered REST APIs using Django and DRF, ensuring smooth client integration. • Built a data migration feature to import legacy Excel data into PostgreSQL. • Contributed to frontend development with Angular, improving UX and UI functionality. Leave Management System (Internship Project) | Python, Django, PostgreSQL, Angular\n• Developed Django REST APIs with SMS and email notifications. • Enhanced the Angular frontend for improved usability and efficiency."}]